# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21


# Пример использования lambda

#def len(x1, y1, x2, y2):
#    return ((x2-x1)**2+(y2-y1)**2)**0.5


#lambda x1, y1, x2, y2: ((x2-x1)**2+(y2-y1)**2)**0.5

#x1 = 3
#y1 = 6
#x2 = 2
#y2 = 1


#a = ((x2-x1)**2+(y2-y1)**2)**0.5
#print(round(a, 2))

def calc(op, a, b, c, d):
    print(op(a, b, c, d))


calc(lambda x1, y1, x2, y2: (((x2-x1)**2+(y2-y1)**2)**0.5), 3, 6, 2 ,1)
